Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: // welcome now equals "hello there!"
ja: （welcomeは、現在「やあ！、こんにちは」に等しい）

source: // welcome now equals "hello there"
ja: （welcomeは、現在「やあ、こんにちは」に等しい）

source: // welcome now equals "hello!"
ja: （welcomeは、現在「こんにちは！」に等しい）

source: // welcome now equals "hello"
ja: （welcomeは、現在「こんにちは」に等しい）

source: // x is 10, and 20 is ignored
ja: （xは10です、そして20は無視されます）

source: // x is equal to 1, and y is equal to 2
ja: （xは１と等しい、そしてyは２と等しい）

source: // x is now 1
ja: （x は、現在 1 です）

source: // zero as a Double
ja: （浮動小数点のゼロ）

source: // zero as an Int
ja: （整数のゼロ）

source: Advanced Operators covers Swift’s advanced operators, and describes how to define your own custom operators and implement the standard operators for your own custom types.
ja: 先進の演算子では、スウィフトの先進の演算子を取り扱い、加えてあなた独自のあつらえの演算子を定義する方法、そしてあなた独自のあつらえの型のために標準の演算子を実装する方法を解説します。

source: Array Type Shorthand Syntax is now written as [SomeType] rather than SomeType[].
ja: 配列型の短縮形構文は、現在は[SomeType]のように書かれます、SomeType[]ではなく。

source: Assertions and Preconditions can now use string interpolation.
ja: 表明と前提条件は今では文字列補間を使うことができます。

source: Optionals no longer implicitly evaluate to true when they have a value and false when they do not, to avoid confusion when working with optional Bool values.
ja: オプショナルはもはや暗黙的に、それが値を持つときtrueに、そしてそれがそうしないときfalseに評価されません、それによってオプショナルBoolを扱うときの混乱を防ぐためです。

source: (3 % 4) is 3, so this is equivalent to:
ja: (3 % 4)は3なので、これは以下に等しいです：

source: (3 * 5) is 15, so this is equivalent to:
ja: (3 * 5)は15なので、これは以下に等しいです：

source: 0xFp-2 means 15 x 2-2, or 3.75.
ja: 0xFp-2は、15 × 2-2、または3.75を意味します。

source: 0xFp2 means 15 x 22, or 60.0.
ja: 0xFp2は、15 × 22、または60.0を意味します。

source: 1.25e-2 means 1.25 x 10-2, or 0.0125.
ja: 1.25e-2は、1.25 × 10-2、または0.0125を意味します。

source: 1.25e2 means 1.25 x 102, or 125.0.
ja: 1.25e2は、1.25 × 102、または125.0を意味します。

source: 123456789[0] returns 9
ja: 123456789[0]は9を返します

source: 123456789[1] returns 8
ja: 123456789[1]は8を返します

source: 1 times 5 equals 5
ja: 1掛ける5は5に等しい

source: 2 plus 3 equals 5
ja: 2足す3は5に等しい

source: 5 remainder 4 equals 1
ja: 5割る4の余りは1に等しい

source: >= or < followed by a version number
ja: >=または<にバージョン番号が続きます

source: @autoclosure is now an attribute of the parameter declaration, not its type.
ja: @autoclosureは今ではパラメーター宣言の属性です、それの型ではありません。

source: Any can represent an instance of any type at all, including function types.
ja: Anyは、関数型を含めて、ともかくどんな型のインスタンスでも表すことができます。

source: AnyObject can represent an instance of any class type.
ja: AnyObjectは、どんなクラス型のインスタンスでも表すことができます。

source: Bank keeps track of the current number of coins it holds with its coinsInBank property.
ja: Bankは、それがそのcoinsInBankプロパティで保持するコインの現在の数の情報を得続けます。

source: C1 must conform to the Container protocol (written as C1: Container).
ja: C1は、Containerプロトコルに準拠しなければなりません（C1: Containerのように書かれます）。

source: C2 must also conform to the Container protocol (written as C2: Container).
ja: C2もまた、Containerプロトコルに準拠しなければなりません（C2: Containerのように書かれます）。

source: Color provides an initializer with three appropriately named parameters of type Double for its red, green, and blue components.
ja: Colorはイニシャライザに、それの赤、緑、および青の構成要素に対する３つの適切に命名された型Doubleのパラメータを提供します。

source: Dice also has an initializer, to set up its initial state.
ja: Diceはまた、その最初の状態を設定するために、イニシャライザを持ちます。

source: Dice provides one instance method, roll, which returns an integer value between 1 and the number of sides on the dice.
ja: Diceは１つのインスタンスメソッド、rollを提供します、それは、１とさいころ上の面の数との間の整数値を返します。

source: DiceGameDelegate provides three methods for tracking the progress of a game.
ja: DiceGameDelegateは、３つのメソッドをゲームの進捗を追うために提供します。

source: DiceGameTracker implements all three methods required by DiceGameDelegate.
ja: DiceGameTrackerは、DiceGameDelegateによって要求される３つのメソッド全てを実装します。

source: Double has a precision of at least 15 decimal digits, whereas the precision of Float can be as little as 6 decimal digits.
ja: Doubleは少なくとも10進数で15桁の精度を持ちます、一方でFloatの精度は10進数で６桁ほどです。

source: Double represents a 64-bit floating-point number.
ja: Doubleは、64ビットの浮動小数点数を表します。

source: Element defines a placeholder name for a type to be provided later.
ja: Elementは、プレースホルダ名を、後で提供されることになるある型に対して定義します。

source: Float represents a 32-bit floating-point number.
ja: Floatは、32ビットの浮動小数点数を表します。

source: LevelTracker also defines two type functions to work with the highestUnlockedLevel property.
ja: LevelTrackerはまた、２つの型関数を定義してhighestUnlockedLevelプロパティを取り扱います。

source: Matrix provides an initializer that takes two parameters called rows and columns, and creates an array that is large enough to store rows * columns values of type Double.
ja: Matrixはひとつのイニシャライザを提供します、それはrowsとcolumnsと呼ばれる２つのパラメータをとり、型Doubleで個数rows * columnsの値を格納するのに十分大きい配列をつくります。

source: Point encapsulates the x- and y-coordinate of a point.
ja: Pointは、ある地点のxおよひy座標をカプセル化します。

source: Rank also defines a computed property, values, which returns an instance of the Values structure.
ja: Rankはまた、ある計算プロパティ、valuesを定義します、それは、Values構造体のインスタンスを返します。

source: RecipeIngredient also defines a convenience initializer, init(name: String), which is used to create a RecipeIngredient instance by name alone.
ja: RecipeIngredientはまた、便宜イニシャライザ、init(name: String)を定義します、それは、名前だけでRecipeIngredientインスタンスを作成するのに使われることができます。

source: Rect defines a rectangle by an origin point and a size.
ja: Rectは、原点と大きさによって長方形を定義します。

source: Residence instances have a single Int property called numberOfRooms, with a default value of 1.
ja: Residenceインスタンスは、numberOfRoomsと呼ばれる省略時の値1を持つIntプロパティただひとつを持ちます。

source: ShoppingListItem does not define an initializer to provide an initial value for purchased, because items in a shopping list (as modeled here) always start out unpurchased.
ja: ShoppingListItemはpurchasedに初期値を用意するイニシャライザを定義しません、なぜなら、購入品目リストの項目が（ここでモデル化されるように）常に未購入で始められるからです。

source: Size encapsulates a width and a height.
ja: Sizeは、widthとheightをカプセル化します。

source: SomeType(ofInitialValue) is the default way to call the initializer of a Swift type and pass in an initial value.
ja: SomeType(ofInitialValue)は、あるスウィフト型のイニシャライザを呼んで、初期値を渡すために通常使う方法です。

source: String values can be added together (or concatenated) with the addition operator (+) to create a new String value:
ja: String値は、新しいString値をつくるために加算演算子（+）を使って１つに足し合わされる（または連結される）ことができます：

source: String values can be constructed by passing an array of Character values as an argument to its initializer:
ja: String値は、Character値の配列をそれのイニシャライザへの引数として渡すことによって組み立てられることができます。

source: Tandem inherits all of the properties and methods from Bicycle, which in turn inherits all of the properties and methods from Vehicle.
ja: Tandemは、すべてのプロパティとメソッドをBicycleから継承します、そして今度はそれがすべてのプロパティとメソッドをVehicleから継承します。

source: UInt8 integers have eight bits and can store any value between 0 and 255.
ja: UInt8整数は、８ビットを持ち、0と255の間でのどんな値でも格納することができます。

source: a == a (Reflexivity)
ja: a == a（反射性）

source: a == b implies b == a (Symmetry)
ja: a == bがb == aを意味する（対称性）

source: anotherContainer is a container of type C2.
ja: anotherContainerは、型C2のコンテナです。

source: board[0] always equals 0 and has no effect.
ja: board[0]は、常に0に等しくて、効果を持ちません。

source: didSet is called immediately after the new value is stored.
ja: didSetは、新しい値が格納された直後に呼ばれます。

source: first, of type Int
ja: first、型Intのもの

source: increment() increments the counter by 1.
ja: increment()は、1だけカウンターを増加させます。

source: increment(by: Int) increments the counter by a specified integer amount.
ja: increment(by: Int)は、指定された量の整数でカウンターを増加させます。

source: item is Movie returns true if the current MediaItem is a Movie instance and false if it is not.
ja: item is Movieは、現在のMediaItemがMovieインスタンスであるならばtrueを、そうでないならばfalseを返します。

source: john.residence now contains an actual Residence instance, rather than nil.
ja: john.residenceは、今では実際のResidenceインスタンスを含みます、nilではなく。

source: nil and the Booleans true and false are now Literals.
ja: nilとブールのtrueおよびfalseは現在リテラルです。

source: number.kind is already known to be of type Int.Kind.
ja: number.kindは、既に型Int.Kindであると知られます。

source: repeat-while evaluates its condition at the end of each pass through the loop.
ja: repeat-whileは、その条件を、ループを通り抜けるそれぞれの終わりで評価します。

source: reset() resets the counter to zero.
ja: reset()は、カウンターをゼロに再設定します。

source: second, of type Int?, or “optional Int”
ja: second、型Int?、つまり「オプショナルのInt」

source: someContainer and anotherContainer contain the same type of items.
ja: someContainerとanotherContainerは、同じ型の項目を含みます。

source: someContainer is a container of type C1.
ja: someContainerは、型C1のコンテナです。

source: while evaluates its condition at the start of each pass through the loop.
ja: whileは、その条件を、ループを通り抜けるそれぞれの始まりで評価します。

source: willSet is called just before the value is stored.
ja: willSetは、値が格納される直前に呼ばれます。

source: HTMLElement also defines an optional text property, which you can set to a string that represents the text to be rendered within that HTML element.
ja: HTMLElementはまた、オプショナルのtextプロパティを定義します、それは、あなたはそれをテキストがそのHTML要素の範囲内で提出されると述べる文字列に設定することができます。

source: tenEighty and alsoTenEighty themselves don’t “store” the VideoMode instance—instead, they both refer to a VideoMode instance behind the scenes.
ja: tenEightyおよびalsoTenEightyそれら自身はVideoModeインスタンスを格納しません ― そうではなく、それらが両方とも言及するのは舞台裏でVideoModeインスタンスです。

source: currentValue has an initial value of 3, which means that currentValue > 0 returns true, causing chooseStepFunction(backward:) to return the stepBackward(_:) function.
ja: currentValueは3の初期値を持ちます、そしてそれは、currentValue > 0がtrueを返して、chooseStepFunction(backward:)がstepBackward(_:)関数を返すことを引き起こすのを意味します。

source: Dice instances have an integer property called sides, which represents how many sides they have, and a property called generator, which provides a random number generator from which to create dice roll values.
ja: Diceインスタンスは、それがどれくらいの面を持つのかを表すsidesと呼ばれる整数プロパティ、そしてそこからさいころを振った値を作成する乱数生成器を提供するgeneratorと呼ばれるプロパティを持ちます。

source: Character values are described in Strings and Characters.
ja: Character値は文字列と文字で記述されます。

source: Color also provides a second initializer with a single white parameter, which is used to provide the same value for all three color components.
ja: Colorはまた、ただ１つのwhiteパラメータを持つ第２のイニシャライザを提供します、それは３つの色構成要素すべてに同じ値を提供するのに使用されます。

source: Stack provides two methods, push and pop, to push and pop values on and off the stack.
ja: Stackは２つのメソッド、pushとpopを提供します、それでスタック上に値を押し込んだり飛び出させたりします。

source: Dictionary needs its keys to be hashable so that it can check whether it already contains a value for a particular key.
ja: Dictionaryは、それが特定のキーのためにすでに値を含むかどうか確認できるように、そのキーにハッシュ化できることを必要とします。

source: if and while statements are described in more detail in Control Flow.
ja: ifおよびwhile文は更に詳細に「制御の流れ」で記述されます。

source: CartItem introduces a stored constant property called quantity and ensures that this property always has a value of at least 1:
ja: CartItemはquantityと呼ばれる格納定数プロパティを導入します、そしてこのプロパティが常に少なくとも1の値を持つことを確実にします：

source: ShoppingListItem also adds a computed description property, which provides a textual description of a ShoppingListItem instance:
ja: ShoppingListItemはまた、計算されるdescriptionプロパティを加えます、それは、ShoppingListItemインスタンスのテキストでの解説を提供します：

source: Suffix has two constraints: It must conform to the SuffixableContainer protocol (the protocol currently being defined), and its Item type must be the same as the container’s Item type.
ja: Suffixは、２つの制約を持ちます：それはSuffixableContainerプロトコル（そのプロトコルはいま定義されるところです）に準拠しなければなりません、そしてそれのItem型はコンテナのもつItem型と同じでなければなりません。

source: Person instances have an optional residence property of type Residence?.
ja: Personインスタンスは、型Residence?のオプショナルresidenceプロパティを持ちます。

source: Access control restricts access to parts of your code from code in other source files and modules.
ja: アクセス制御は、あなたのコードの各部への他のソースファイルとモジュールの中のコードからのアクセスを制限します。

source: Assertions and preconditions are checks that happen at runtime.
ja: 表明と前提条件は、起こることを実行時で調べられます。

source: Binary expressions combine an infix binary operator with the expression that it takes as its left-hand and right-hand arguments.
ja: 二項式は、接中辞二進数演算子を、それがその左手側と右手側の引数としてとる式と組み合わせます。

source: Binary operators operate on two targets (such as 2 + 3) and are infix because they appear in between their two targets.
ja: 二項演算子は、２つの目標に作用します（例えば2 + 3のように）、そしてそれがそれら２つの目標の間に現れるので接中辞です。

source: Bitwise operators enable you to manipulate the individual raw data bits within a data structure.
ja: ビット単位演算子は、あなたにあるデータ構造内の個々の生のデータ・ビットを操作することを可能にします。

source: Closure expressions are a way to write inline closures in a brief, focused syntax.
ja: クロージャ式は、簡潔な、焦点のあった構文で、処理の流れに組み込まれた（行内の、インラインの）クロージャを書く方法です。

source: Closures are self-contained blocks of functionality that can be passed around and used in your code.
ja: クロージャは、機能性の完全独立のブロック、かたまりです、それは、あなたのコードにおいてあちこちに渡され使われることができます。

source: Compound assignment operators combine assignment (=) with another operation.
ja: 複合代入演算子は、代入（=）を別の操作と組み合わせます。

source: Control transfer statements change the order in which your code is executed, by transferring control from one piece of code to another.
ja: 制御移動文は、制御をコードのひとつの部分から別のものまで移すことによって、あなたのコードが実行される順番を変えます。

source: Convenience initializers are secondary, supporting initializers for a class.
ja: 便宜イニシャライザは副次的なもので、あるクラスのためのイニシャライザを支援します。

source: Declaration modifiers are keywords or context-sensitive keywords that modify the behavior or meaning of a declaration.
ja: 宣言修飾子は、キーワードまたは文脈依存キーワードです、それは宣言のふるまいや意味することを修正します。

source: Delegation is a design pattern that enables a class or structure to hand off (or delegate) some of its responsibilities to an instance of another type.
ja: 委任は、クラスまたは構造体にそれのもつ責務の一部を別の型のインスタンスへと手渡す（または委任する）ことを可能にするデザイン・パターンです。

source: Designated initializers are the primary initializers for a class.
ja: 指定イニシャライザは、あるクラスのための主要なイニシャライザです。

source: Error handling is the process of responding to and recovering from error conditions in your program.
ja: エラー処理は、あなたのプログラムにおいてエラー状態へ応答してそこから復旧する過程です。

source: Extensions add new functionality to an existing class, structure, enumeration, or protocol type.
ja: 拡張は、新しい機能性を既存のクラス、構造体、列挙、またはプロトコル型に加えます。

source: File-private access restricts the use of an entity to its own defining source file.
ja: ファイル外非公開アクセス（ファイル私用）は、ある実在の使用をそれ自身の定義ソースファイルに制限します。

source: Floating-point literals represent floating-point values of unspecified precision.
ja: 浮動小数点リテラルは、不特定精度の浮動小数点値を表します。

source: Floating-point numbers are numbers with a fractional component, such as 3.14159, 0.1, and -273.15.
ja: 浮動小数点数は小数部を持つ数です、例えば3.14159、0.1、そして-273.15など。

source: Functions are self-contained chunks of code that perform a specific task.
ja: 関数は、特定の作業を実行する完全独立の大きな塊のコードです。

source: Generic code enables you to write flexible, reusable functions and types that can work with any type, subject to requirements that you define.
ja: 総称体コードは、あなたに柔軟な、再使用できる関数と型を書くことを可能にします、それは、あなたが定義する要件を満たした場合に限り、あらゆる型を扱うことができます。

source: Generic functions can work with any type.
ja: 総称体関数は、どんな型でも扱うことができます。

source: Identifiers begin with an uppercase or lowercase letter A through Z, an underscore (_), a noncombining alphanumeric Unicode character in the Basic Multilingual Plane, or a character outside the Basic Multilingual Plane that isn’t in a Private Use Area.
ja: 識別子は、大文字または小文字のAからZ、アンダースコア（_）、基本多言語面の非合成英数字のUnicode文字、または基本他言語面の外側ての使用領域の中でない文字で始まります。

source: Initialization is the process of preparing an instance of a class, structure, or enumeration for use.
ja: 初期化は、クラス、構造体、または列挙のインスタンスを使用するために前準備する処理です。

source: Initializers are called to create a new instance of a particular type.
ja: イニシャライザは、特定の型の新しいインスタンスをつくるために呼ばれます。

source: Instance methods are functions that belong to instances of a particular class, structure, or enumeration.
ja: インスタンスメソッドは、特定のクラス、構造体、または列挙のインスタンスに属している機能です。

source: Integer literals represent integer values of unspecified precision.
ja: 整数リテラルは、無限精度の整数値を表します。

source: Integers are whole numbers with no fractional component, such as 42 and -23.
ja: 整数は、小数部分のない数すべてです、例えば42や-23など。

source: Internal access enables entities to be used within any source file from their defining module, but not in any source file outside of that module.
ja: 内部アクセス（内部用）は、実在たちが、それらの定義モジュールからのあらゆるソースファイル内で使われることを可能にします、しかし、そのモジュールの外側のいかなるソースファイルの中も除きます。

source: Logical operators modify or combine the Boolean logic values true and false.
ja: 論理演算子は、ブールの論理値trueおよびfalseを修正または結合します。

source: Methods are functions that are associated with a particular type.
ja: メソッドは、特定の型と結び付けられる関数です。

source: Open access and public access enable entities to be used within any source file from their defining module, and also in a source file from another module that imports the defining module.
ja: 開放アクセスと公開アクセス（公開用）は、実在たちが、それらの定義モジュールからのあらゆるソースファイル内で、そのうえに、定義モジュールをインポートする別のモジュールからのソースファイルの中で、使われることを可能にします。

source: Optional chaining is a process for querying and calling properties, methods, and subscripts on an optional that might currently be nil.
ja: オプショナル連鎖は、現時点でnilであるかもしれないオプショナル上での、プロパティ、メソッド、および添え字への問い合わせや呼び出しのための処理です。

source: Postfix expressions are formed by applying a postfix operator or other postfix syntax to an expression.
ja: 接尾辞式は、接尾辞演算子または他の接尾辞構文を式に適用することによって作り上げられます。

source: Prefix expressions combine an optional prefix operator with an expression.
ja: 接頭辞式では、ある任意の接頭辞演算子をひとつの式と組み合わせます。

source: Primary expressions are the most basic kind of expression.
ja: 基本式は、最も基本的な種類の式です。

source: Private access restricts the use of an entity to the enclosing declaration, and to extensions of that declaration that are in the same file.
ja: 非公開アクセス（私用）は、ある実在の使用をそれを囲んでいる宣言に、そしてその宣言の拡張で同じファイル中のものに制限します。

source: Properties associate values with a particular class, structure, or enumeration.
ja: プロパティは、いくつかの値を特定のクラス、構造体、または列挙と結びつけます。

source: String interpolation is a way to construct a new String value from a mix of constants, variables, literals, and expressions by including their values inside a string literal.
ja: 文字列補間は、定数、変数、リテラル、および式の混合から、それらの値をひとつのリテラル文字列に含めることで、新しいString値を造る方法です。

source: Structures and classes are general-purpose, flexible constructs that become the building blocks of your program’s code.
ja: 構造体およびクラスは、あなたのプログラムのコードの建築ブロックになる、万能で、柔軟な構造物です。

source: Subclassing is the act of basing a new class on an existing class.
ja: サブクラスをつくることは、既存のクラスをもとに新しいクラスを構築する行為です。

source: Ternary operators operate on three targets.
ja: 三項演算子は、３つの目標に作用します。

source: Tuples group multiple values into a single compound value.
ja: タプルは、複数の値を１つの複合値にまとめます。

source: Type aliases define an alternative name for an existing type.
ja: 型エイリアスは、既存の型の代替の名前を定義します。

source: Type casting is a way to check the type of an instance, or to treat that instance as a different superclass or subclass from somewhere else in its own class hierarchy.
ja: 型キャストは、あるインスタンスの型を調べるための、またはそのインスタンスを、それ自身のクラス階層中のどこか他の別のスーパークラスやサブクラスとして扱うための方法です。

source: Unary operators operate on a single target (such as -a).
ja: 単項演算子は、１つだけの目標に作用します（例えば-aなど）。

source: Unicode is an international standard for encoding, representing, and processing text in different writing systems.
ja: ユニコードは、異なる表記体系のテキストを符号化、表現、そして処理するための国際的な基準です。

source: Identical to means that two constants or variables of class type refer to exactly the same class instance.
ja: 同一は、クラス型の２つの定数または変数が、正確に同じクラスインスタンスに言及することを意味します。

source: Equal to means that two instances are considered equal or equivalent in value, for some appropriate meaning of equal, as defined by the type’s designer.
ja: 同等は、２つのインスタンスが、値で「等しい」あるいは「相当する」と、ある適切な等しいの意味で、型の設計者によって定義されたとおりに、考慮されることを意味します。

source: // Boolean literal
ja: （ブールのリテラル）

source: // Floating-point literal
ja: （リテラル浮動小数点）

source: // Integer literal
ja: （リテラル整数）

source: // String literal
ja: （リテラル文字列）

source: // Valid, uses default value
ja: （有効、省略時の値を使う）

source: // COMBINING ACUTE ACCENT, U+0301
ja: （アキュート・アクセント、U+0301を追加する）

source: // Error: return types don't match
ja: （エラー：戻り型は一致しません）

source: // Error
ja: （エラー）

source: // Invalid, alwaysThrows() isn't a throwing parameter
ja: （無効、alwaysThrows()はスローパラメータではありません）

source: // Invalid, missing argument label
ja: （無効、引数ラベルが欠けている）

source: // Invalid, the case has an empty body
ja: （無効、このケース節は空の本文を持ちます）

source: // No actual side effects.
ja: （実際の副作用なし）

source: // equals "hello, world"
ja: （「こんにちは、世界よ」に等しい）

source: // equals -1
ja: （-１に等しい）

source: // equals 1
ja: （１に等しい）

source: // equals 2
ja: （２に等しい）

source: // equals 3
ja: （３に等しい）

source: // equals 4.0
ja: （4.0に等しい）

source: // equals 6
ja: （６に等しい）

source: // false because 2 is not less than or equal to 1
ja: （２が１以下でないので偽）

source: // implicitly file-private class member
ja: （暗黙的にファイル外非公開のクラス・メンバー）

source: // implicitly internal class
ja: （暗黙的に内部のクラス）

source: // implicitly internal
ja: （暗黙的に内部です）

source: // implicitly private class member
ja: （暗黙のうちに非公開のクラス・メンバー）

source: // true because 1 is equal to 1
ja: （１が1と同等なので真）

source: // true because 1 is greater than or equal to 1
ja: （１が１以上なので真）

source: // true because 1 is less than 2
ja: （１が２より小さいので真）

source: // true because 2 is greater than 1
ja: （２が１より大きいので真）

source: // true because 2 is not equal to 1
ja: （２が１と同等でないので真）

source: // 17 in binary notation
ja: （２進法での17）

source: // 17 in hexadecimal notation
ja: （16進法での17）

source: // 17 in octal notation
ja: （８進法での17）

source: // OK: names are inferred
ja: （OK: 名前は推論されます）

source: // T is inferred to be Double
ja: （TはDoubleであると推論されます）

source: // T is inferred to be Int
ja: （Tは、Intであると推論されます）

source: // The type of e is inferred to be Double.
ja: （eの型は、Doubleであると推測されます。）

source: // The type of f is (Int, Int) -> Void, not (left: Int, right: Int) -> Void.
ja: （ f の型は (Int, Int) -> Void です、 (left: Int, right: Int) -> Void ではなく）

source: // Valid, uses the value provided
ja: （有効、提供された値を使う）

source: // Warning
ja: （警告）

source: // alsoMinusSix equals -6
ja: （alsoMinusSixは、-6に等しい）

source: // empty string literal
ja: （空の文字列リテラル）

source: // equals 11110000
ja: （11110000に等しい）

source: // explicitly file-private class member
ja: （明示的にファイル外非公開のクラス・メンバー）

source: // explicitly file-private class
ja: （明示的にファイル外非公開のクラス）

source: // explicitly private class member
ja: （明示的に非公開のクラス・メンバー）

source: // explicitly private class
ja: （明示的に非公開のクラス）

source: // explicitly public class
ja: （明示的に公開のクラス）

source: // implicitly internal class member
ja: （暗黙的に内部のクラス・メンバー）

source: // initializer syntax
ja: （イニシャライザ構文）

source: // minusThree equals -3
ja: （minusThreeは、-3に等しい）

source: // plusThree equals 3, or "minus minus three"
ja: （plusThreeは、3に、または「マイナス マイナス three」に等しい）

source: // count is labeled, greeting is not
ja: （countはラベルを付けられます、greetingは違います）

source: // 00000100 in binary
ja: （２進数での00000100）

source: // Ambiguous
ja: （あいまい）

source: // Chinese symbol for the number 3
ja: （数３に対する中国語記号）

source: // Error because < can't compare Boolean values
ja: （エラー、なぜなら < がブール値を比較できないため）

source: // Error: try applies only to the first function call
ja: （エラー：tryは、最初の関数呼び出しだけに適用されます）

source: // OK, evaluates to true
ja: （OK、trueと評価します）

source: // The type of eFloat is Float.
ja: （eFloatの型はFloatです。）

source: // blueComponent is 0x99, or 153
ja: （blueComponent は 0x99 または 153 です）

source: // e followed by ́
ja: // e に続けて ́

source: // equals 00010001
ja: （00010001に等しい）

source: // equals 00111100
ja: （00111100に等しい）

source: // equals 11111110
ja: （11111110に等しい）

source: // explicitly public class member
ja: （明示的に公開のクラス・メンバー）

source: // maxValue is equal to 255, and is of type UInt8
ja: （maxValuesは255に等しく、そしてUInt8型です）

source: // minValue is equal to 0, and is of type UInt8
ja: （minValuesは0に等しく、そしてUInt8型です）

source: // no need for an exclamation point
ja: （感嘆符の必要はありません）

source: // requires an exclamation point
ja: （感嘆符が要求されます）

source: // true because 1 is less than 2; "zebra" and "apple" are not compared
ja: // １は２より少ないので真；「zebra」と「apple」は比較されません

source: // true because 3 is equal to 3, and "apple" is less than "bird"
ja: （３は３と等しく、「apple」は「bird」より少ないので真）
